/**
 * vue3 新功能新特性
 * 组合式API
 * Teleport
 * 多个根节点片段
*/

/**
 * mvvm 框架
 * HTML5有哪些新特性 CSS3有哪些新特性
 * DOM、BOM 分别是什么
 * Ajax有几种状态
 * HTTP及相关⽹络协议、缓存、跨域
 * 浏览器相关渲染机制
 * JS原型、闭包、作用域
 * 盒模型、常用布局以及浏览器兼容性
 * 移动设备常见面试题 懒加载
 * 除了get、post请求 delete  options请求
 * bind apply call 区别
 * 面向对象思想 具有抽象、封装、继承、多态
 * 
 * vue 和 react 的区别
 * vuex有哪几种属性
*/

/**
 * atm 产险测试平台
 * 版本号 特性、故事、用例、缺陷、统计
 * react hook
 * 
 * 个人工作台：
 * 1. 树状版本 显示某版本内含有的 特性、故事、用例、缺陷、统计
 * 2. 展示个人或者团队的待办故事 或者 待办缺陷, 有逾期和今天待办的温馨提醒.
 * 3. 特性页面：主要用于展示版本下得特性列表信息。
 * 4. 故事页面：根据特性细分的故事数据, 内含测试人员、开发人员、状态等信息. 可进行提测、退回、测试完成等操作
 * 5. 用例页面：根据故事维度作为管理, 提供给测试人员进行 项目上的测试进度结果的记录.
 * 6. 缺陷页面：根据用例维度进行管理, 上报缺陷支持富文本编辑、关联的开发人员、测试人员.
*/

/**
 * 
*/